---
kind: method
id: M:Autodesk.Revit.UI.DoubleClickOptions.SetRenameOnSlowDoubleClickInProjectBrowser(System.Boolean)
source: html/6fff7897-e385-b30e-b131-3f03c07b8ab0.htm
---
# Autodesk.Revit.UI.DoubleClickOptions.SetRenameOnSlowDoubleClickInProjectBrowser Method

Sets whether the desired action is to rename item in project browser on slow double-click.

## Syntax (C#)
```csharp
public void SetRenameOnSlowDoubleClickInProjectBrowser(
	bool bRenameOnSlowDoubleClickInProjectBrowser
)
```

## Parameters
- **bRenameOnSlowDoubleClickInProjectBrowser** (`System.Boolean`)